<a href="https://colab.research.google.com/github/Homaoa/Clustering_e_shop_clothes_Data/blob/main/Data_prepration_E_shop.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np

In [ ]:
url='/content/e-shop clothing 2008.csv'
data=pd.read_csv(url)
data.head()

  year;month;day;order;country;session ID;page 1 (main category);page 2 (clothing model);colour;location;model photography;price;price 2;page
0                 2008;4;1;1;29;1;1;A13;1;5;1;28;2;1
1                 2008;4;1;2;29;1;1;A16;1;6;1;33;2;1
2                 2008;4;1;3;29;1;2;B4;10;2;1;52;1;1
3                 2008;4;1;4;29;1;2;B17;6;6;2;38;2;1
4                  2008;4;1;5;29;1;2;B8;4;3;2;52;1;1

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165474 entries, 0 to 165473
Data columns (total 1 columns):
 #   Column                                                                                                                                       Non-Null Count   Dtype
---  ------                                                                                                                                       --------------   -----
 0   year;month;day;order;country;session ID;page 1 (main category);page 2 (clothing model);colour;location;model photography;price;price 2;page  165474 non-null  object
dtypes: object(1)
memory usage: 1.3+ MB

In [ ]:
#Data from this resource is not prepared. all the data are in one column and the name of this column is the name of all the variables.
#I split the data and put them in correct columns with correct headers.
#First, I look at one observation to find out how to split the data

In [ ]:
a=data['year;month;day;order;country;session ID;page 1 (main category);page 2 (clothing model);colour;location;model photography;price;price 2;page'][1]
print(a)

2008;4;1;2;29;1;1;A16;1;6;1;33;2;1

In [6]:
year=[]
month=[]
day=[]
order=[]
country=[]
session=[]
page1=[]
page2=[]
color=[]
location=[]
model=[]
price=[]
price2=[]
page=[]

for i in range(0,165473):
  j=str(data['year;month;day;order;country;session ID;page 1 (main category);page 2 (clothing model);colour;location;model photography;price;price 2;page'][i])
  year.append(j.split(';')[0])
  month.append(j.split(';')[1])
  day.append(j.split(';')[2])
  order.append(j.split(';')[3])
  country.append(j.split(';')[4])
  session.append(j.split(';')[5])
  page1.append(j.split(';')[6])
  page2.append(j.split(';')[7])
  color.append(j.split(';')[8])
  location.append(j.split(';')[9])
  model.append(j.split(';')[10])
  price.append(j.split(';')[11])
  price2.append(j.split(';')[12])
  page.append(j.split(';')[13])

In [7]:
data_organized={'Year':year,'Month':month,'Day':day,'Order':order,'Country':country,'Session ID':session,'Page 1 (main category)':page1,'Page 2 (clothing model)':page2,'Color':color,
                'Location':location,'Model photography':model,'Price':price,'Price 2':price2,'Page':page
                }
df=pd.DataFrame(data_organized)
df.head()

   Year Month Day Order Country  ... Location Model photography Price Price 2 Page
0  2008     4   1     1      29  ...        5                 1    28       2    1
1  2008     4   1     2      29  ...        6                 1    33       2    1
2  2008     4   1     3      29  ...        2                 1    52       1    1
3  2008     4   1     4      29  ...        6                 2    38       2    1
4  2008     4   1     5      29  ...        3                 2    52       1    1

[5 rows x 14 columns]

In [ ]:
#Now data are organized. I save them as a new csv model to work on them in later parts

In [8]:
df.to_csv('E_shop_cleaned_data.csv')